bookstore_Crud/app/views/libros/index.html.erb

SELECT "libros".* FROM "libros"
---
	<%
	libros = Libro.all