app/controllers/libros_controller.rb

  def alta
    @libro = Libro.new
    @libro.titulo = params[:titulo]
    @libro.autor = params[:autor]
    @libro.genero = params[:genero]
    @libro.save
---
INSERT INTO "libros" ("autor", "created_at", "genero", "titulo", "updated_at") VALUES (?, ?, ?, ?, ?)  [["autor", "sdfsada"], ["created_at", "2016-02-17 09:23:54.738368"], ["genero", "fdsa"], ["titulo", "dfdsa"], ["updated_at", "2016-02-17 09:23:54.738368"]]

  def modificar_vista
    id = params[:id].to_i
    @libro = Libro.find id
---
SELECT  "libros".* FROM "libros"  WHERE "libros"."id" = ? LIMIT 1  [["id", 4]]

  def modificar
    id = params[:id].to_i
    @libro = Libro.find id
    @libro.titulo = params[:titulo]
    @libro.autor = params[:autor]
    @libro.genero = params[:genero]
    @libro.save
---
SELECT  "libros".* FROM "libros"  WHERE "libros"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "libros" SET "genero" = ?, "updated_at" = ? WHERE "libros"."id" = 4  [["genero", "Teatral"], ["updated_at", "2016-02-17 09:24:06.163343"]]

  def baja
    arrayIds = params[:ids]
    Libro.delete arrayIds
---
DELETE FROM "libros" WHERE "libros"."id" IN (5)

  def buscar_titulo
    titulo = params[:valor]
    @librosEncontrados = Libro.where(:titulo => titulo)
---
SELECT "libros".* FROM "libros"  WHERE "libros"."titulo" = 'jlfkdsl'

  def buscar_autor
    autor = params[:valor]
    @librosEncontrados = Libro.where(autor: autor)
---
SELECT "libros".* FROM "libros"  WHERE "libros"."autor" = 'sdfsda'

  def buscar_genero
    genero = params[:valor]
    @librosEncontrados = Libro.where(genero: genero)
---
SELECT "libros".* FROM "libros"  WHERE "libros"."genero" = 'Aventuras'